app/controllers/bands_controller.rb

  def show_favorites
    @favorite  = Favorite.find_by_user_id(params[:user_id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = '100001178828821' LIMIT 1

  def show
    #@band = Band.find_by_fb_id(params[:id])
    @band = Band.find(params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @band = Band.new(params[:band])
    @same_fb_id = Band.find_by_fb_id(@band.fb_id)
    if @same_fb_id == nil
      @band.save
---
SELECT "bands".* FROM "bands" WHERE "bands"."fb_id" = '341582085862264' LIMIT 1
INSERT INTO "bands" ("city", "created_at", "description", "fb_id", "genre_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)