app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
  def index
    @concerts = Concert.all

SELECT "concerts".* FROM "concerts" WHERE "concerts"."band_id" = '100001178828821' LIMIT 1
---
  def show_by_band_id
	@concerts = Concert.find_by_band_id(params[:band_id])

SELECT "concerts".* FROM "concerts" ORDER BY "concerts"."id" DESC LIMIT 1
---
  def show_participates
    @concert  = Concert.last()

SELECT "concerts".* FROM "concerts" ORDER BY "concerts"."id" DESC LIMIT 1
---
  def show_participates_past
    @concert  = Concert.last()

SELECT "concerts".* FROM "concerts" ORDER BY "concerts"."id" DESC LIMIT 1
---
  def show_participates_future
    @concert  = Concert.last()

SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @concert = Concert.find(params[:id])

SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @concert = Concert.find(params[:id])

INSERT INTO "concerts" ("band_id", "city", "created_at", "date_time", "description", "location", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @concert = Concert.new(params[:concert])
	@concert.save

SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "concerts" SET "date_time" = '2013-08-17 13:36:00.000000', "updated_at" = '2013-04-24 07:12:06.840252' WHERE "concerts"."id" = 1
---
  def update
    @concert = Concert.find(params[:id])
	@concert.update_attributes(params[:concert])