app/controllers/favorites_controller.rb

  def index
    @favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

  def show_favorites
    @favorite  = Favorite.find_by_user_id(params[:user_id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2 LIMIT 1

  def show_favorites_of_band_id
    @favorite  = Favorite.find_by_band_id(params[:band_id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."band_id" = '111209875980' LIMIT 1

  def show
    @favorite = Favorite.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @favorite = Favorite.new(params[:favorite])
    @same = Favorite.find_by_user_id_and_band_id(@favorite.user_id, @favorite.band_id)
    if @same == nil
      @favorite.save
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = '2' AND "favorites"."band_id" = '3' LIMIT 1
INSERT INTO "favorites" ("band_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["band_id", 2], ["created_at", Mon, 15 Apr 2013 18:04:45 UTC +00:00], ["updated_at", Mon, 15 Apr 2013 18:04:45 UTC +00:00], ["user_id", 2]]

  def destroy
    @favorite = Favorite.find(params[:id])
    @favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]