app/controllers/participates_controller.rb

SELECT "participates".* FROM "participates"
---
  def index
    @participates = Participate.all

SELECT "participates".* FROM "participates" WHERE "participates"."concert_id" = 1 LIMIT 1
---
 def show_by_concert_id
	@participates = Participate.find_by_concert_id(params[:concert_id])

SELECT "participates".* FROM "participates" WHERE "participates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @participate = Participate.find(params[:id])

SELECT "participates".* FROM "participates" WHERE "participates"."user_id" = '100001178828821' AND "participates"."concert_id" = 1 LIMIT 1
INSERT INTO "participates" ("concert_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["concert_id", 1], ["created_at", Wed, 24 Apr 2013 07:05:41 UTC +00:00], ["updated_at", Wed, 24 Apr 2013 07:05:41 UTC +00:00], ["user_id", "100001178828821"]]
---
  def create
    @participate = Participate.new(params[:participate])
    @same_fb_id = Participate.find_by_user_id_and_concert_id(@participate.user_id, @participate.concert_id)
    if @same_fb_id == nil
      @participate.save