app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."fb_id" = '100001178828821	' LIMIT 1
INSERT INTO "users" ("city", "created_at", "fb_id", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @same_fb_id = User.find_by_fb_id(@user.fb_id)
    if @same_fb_id == nil
      @user.save